# Task 1 - Fitbit Dataset

1. Read this dataset in pandas , mysql and mongodb 
2. while creting a table in mysql dont use manual approach to create it  ,always use a automation to create a table in mysql
3. convert all the dates avaible in dataset to timestamp format in pandas and in sql you to convert it in date format
4. Find out in this data that how many unique id's we have 
5. which id is one of the active id that you have in whole dataset 
6. how many of them have not logged there activity find out in terms of number of ids 
7. Find out who is the laziest person id that we have in dataset 
8. Explore over an internet that how much calories burn is required for a healthy person and find out how many healthy person we have in our dataset 
9. how many person are not a regular person with respect to activity try to find out those 
10. who is the thired most active person in this dataset find out those in pandas and in sql both . 
11. who is the 5th most laziest person avilable in dataset find it out 
12. what is a totla acumulative calories burn for a person find out

In [3]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import pymongo

In [64]:
import numpy as np

In [ ]:
# 1. Read this dataset in pandas , mysql and mongodb

In [4]:
df = pd.read_csv('FitBit data.csv')

In [3]:
df.head()

,Id,ActivityDate,TotalSteps,TotalDistance,TrackerDistance,LoggedActivitiesDistance,VeryActiveDistance,ModeratelyActiveDistance,LightActiveDistance,SedentaryActiveDistance,VeryActiveMinutes,FairlyActiveMinutes,LightlyActiveMinutes,SedentaryMinutes,Calories
0,1503960366,3/25/2016,11004,7.11,7.11,0.0,2.57,0.46,4.07,0.0,33,12,205,804,1819
1,1503960366,3/26/2016,17609,11.55,11.55,0.0,6.92,0.73,3.91,0.0,89,17,274,588,2154
2,1503960366,3/27/2016,12736,8.53,8.53,0.0,4.66,0.16,3.71,0.0,56,5,268,605,1944
3,1503960366,3/28/2016,13231,8.93,8.93,0.0,3.19,0.79,4.95,0.0,39,20,224,1080,1932
4,1503960366,3/29/2016,12041,7.85,7.85,0.0,2.16,1.09,4.61,0.0,28,28,243,763,1886

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 15 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Id                        457 non-null    int64
 1   ActivityDate              457 non-null    object
 2   TotalSteps                457 non-null    int64
 3   TotalDistance             457 non-null    float64
 4   TrackerDistance           457 non-null    float64
 5   LoggedActivitiesDistance  457 non-null    float64
 6   VeryActiveDistance        457 non-null    float64
 7   ModeratelyActiveDistance  457 non-null    float64
 8   LightActiveDistance       457 non-null    float64
 9   SedentaryActiveDistance   457 non-null    float64
 10  VeryActiveMinutes         457 non-null    int64
 11  FairlyActiveMinutes       457 non-null    int64
 12  LightlyActiveMinutes      457 non-null    int64
 13  SedentaryMinutes          457 non-null    int64
 14  Calories                  457 non-null    int64
dtypes: float64(7), int64(7), object(1)
memory usage: 53.7+ KB

In [ ]:
df = df.astype({'Id':str})

In [ ]:
df.index = df.Id

In [ ]:
df.drop('Id', axis=1, inplace=True)

In [ ]:
# 2. while creting a table in mysql dont use manual approach to create it  ,always use a automation to create a table in mysql

In [5]:
engine = create_engine("mysql+pymysql://" + "root" + ":" + "Abhishek@1067" + "@" + "localhost" + "/" + "mysql_python")

In [ ]:
df.to_sql('fitbit_to_sql', con=engine, if_exists = 'append',index = False, chunksize = 1000)

In [6]:
engine.execute('select * from fitbit_to_sql limit 5').fetchall()

[(1503960366, '3/25/2016', 11004, 7.1100001335144, 7.1100001335144, 0.0, 2.5699999332428, 0.46000000834465, 4.07000017166138, 0.0, 33, 12, 205, 804, 1819),
 (1503960366, '3/26/2016', 17609, 11.5500001907349, 11.5500001907349, 0.0, 6.92000007629395, 0.730000019073486, 3.91000008583069, 0.0, 89, 17, 274, 588, 2154),
 (1503960366, '3/27/2016', 12736, 8.52999973297119, 8.52999973297119, 0.0, 4.65999984741211, 0.159999996423721, 3.71000003814697, 0.0, 56, 5, 268, 605, 1944),
 (1503960366, '3/28/2016', 13231, 8.93000030517578, 8.93000030517578, 0.0, 3.19000005722046, 0.790000021457672, 4.94999980926514, 0.0, 39, 20, 224, 1080, 1932),
 (1503960366, '3/29/2016', 12041, 7.84999990463257, 7.84999990463257, 0.0, 2.16000008583069, 1.0900000333786, 4.6100001335144, 0.0, 28, 28, 243, 763, 1886)]

In [7]:
client = pymongo.MongoClient("mongodb+srv://root:root@cluster0.juny6.mongodb.net/?retryWrites=true&w=majority")
db = client.test

In [8]:
print(db)

Database(MongoClient(host=['cluster0-shard-00-01.juny6.mongodb.net:27017', 'cluster0-shard-00-02.juny6.mongodb.net:27017', 'cluster0-shard-00-00.juny6.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-av6fij-shard-0', tls=True), 'test')

In [ ]:
data = df.to_dict()
#data

In [ ]:
db = client['tasks_ineuron']
col = db['task_fitbit']

In [ ]:
col.insert_many([data])

In [ ]:
col.count_documents({})

In [ ]:
# 3. convert all the dates avaible in dataset to timestamp format in pandas and in sql you to convert it in date format

In [6]:
df['ActivityDate'] = pd.to_datetime(df['ActivityDate'])

In [ ]:
# 4. Find out in this data that how many unique id's we have

In [8]:
len(df['Id'].unique())

35

In [ ]:
# 5. which id is one of the active id that you have in whole dataset

In [9]:
df.Id.value_counts().max()

32

In [10]:
df.Id.unique()

array([1503960366, 1624580081, 1644430081, 1844505072, 1927972279,
       2022484408, 2026352035, 2320127002, 2347167796, 2873212765,
       2891001357, 3372868164, 3977333714, 4020332650, 4057192912,
       4319703577, 4388161847, 4445114986, 4558609924, 4702921684,
       5553957443, 5577150313, 6117666160, 6290855005, 6391747486,
       6775888955, 6962181067, 7007744171, 7086361926, 8053475328,
       8253242879, 8378563200, 8583815059, 8792009665, 8877689391],
      dtype=int64)

In [11]:
df.Id.value_counts()

4020332650    32
4057192912    32
1624580081    19
1503960366    19
2347167796    15
4445114986    15
4702921684    15
6962181067    14
7007744171    12
2022484408    12
8792009665    12
2873212765    12
7086361926    12
8253242879    12
8378563200    12
2026352035    12
3977333714    12
5553957443    12
1844505072    12
8877689391    12
2320127002    12
4319703577    12
4558609924    12
1927972279    12
8053475328    11
5577150313    11
6117666160    10
1644430081    10
6290855005    10
3372868164    10
6391747486     9
6775888955     9
8583815059     8
2891001357     8
4388161847     8
Name: Id, dtype: int64

In [14]:
for i in df.Id.unique():
    maxx = df.Id.value_counts().max()
    if len(df[df['Id']==i].index) == maxx:
        print(f'{i}: {maxx}')

4020332650: 32
4057192912: 32

In [ ]:
# 6. how many of them have not logged there activity find out in terms of number of ids

In [ ]:
# 7. Find out who is the laziest person id that we have in dataset

In [16]:
df.TotalSteps.min()

0

In [17]:
df[df.TotalSteps==df.TotalSteps.min()]['Id']

51     1844505072
52     1844505072
59     1844505072
96     2320127002
97     2320127002
          ...
402    8253242879
403    8253242879
404    8253242879
405    8253242879
412    8253242879
Name: Id, Length: 61, dtype: int64

In [18]:
df.TotalSteps.max()

28497

In [20]:
df[df.TotalSteps==df.TotalSteps.max()]['Id']

454    8877689391
Name: Id, dtype: int64

In [ ]:
# 8. Explore over an internet that how much calories burn is required for a healthy person and find out how many healthy person we have in our dataset

In [24]:
df[df['Calories'] > 1650]['Id'].count()

362

In [ ]:
# 9. how many person are not a regular person with respect to activity try to find out those

In [32]:
df[(df['Id']==1844505072) & (df['Calories'] < 1650)]['Id'].count()

5

In [33]:
df[(df['Id']==1844505072) & (df['Calories'] > 1650)]['Id'].count()

7

In [36]:
for id in df.Id.unique():
    if df[(df['Id']==id) & (df['Calories'] < 1650)]['Id'].count() and df[(df['Id']==id) & (df['Calories'] > 1650)]['Id'].count():
        print(id)

1503960366
1644430081
1844505072
1927972279
2022484408
2320127002
2347167796
2873212765
2891001357
3372868164
3977333714
4020332650
4057192912
4319703577
4388161847
4445114986
4558609924
4702921684
5553957443
5577150313
6117666160
6290855005
6391747486
6775888955
6962181067
7007744171
7086361926
8053475328
8253242879
8792009665
8877689391

In [ ]:
#10. who is the thired most active person in this dataset find out those in pandas and in sql both

In [37]:
df2 = df.groupby('Id')['ActivityDate'].count().sort_values(ascending=False).reset_index()

In [42]:
df2.columns = ['ID', 'count']

In [73]:
df2

            ID  count
0   4057192912     32
1   4020332650     32
2   1503960366     19
3   1624580081     19
4   2347167796     15
5   4702921684     15
6   4445114986     15
7   6962181067     14
8   2320127002     12
9   4558609924     12
10  8792009665     12
11  8378563200     12
12  8253242879     12
13  7086361926     12
14  7007744171     12
15  2026352035     12
16  5553957443     12
17  8877689391     12
18  1844505072     12
19  2022484408     12
20  2873212765     12
21  3977333714     12
22  1927972279     12
23  4319703577     12
24  8053475328     11
25  5577150313     11
26  6290855005     10
27  1644430081     10
28  6117666160     10
29  3372868164     10
30  6391747486      9
31  6775888955      9
32  2891001357      8
33  8583815059      8
34  4388161847      8

In [72]:
df2[df2['count']==df2['count'].unique()[2]]

           ID  count
4  2347167796     15
5  4702921684     15
6  4445114986     15

In [ ]:
#11. who is the 5th most laziest person avilable in dataset find it out

In [56]:
df.groupby(['Id'])['TotalSteps'].sum().sort_values().reset_index()

            Id  TotalSteps
0   4388161847           0
1   2891001357        6189
2   6391747486       12032
3   6290855005       16181
4   8583815059       24364
5   1927972279       26170
6   8253242879       28679
7   8792009665       37139
8   2320127002       37661
9   2026352035       40713
10  1844505072       43687
11  6775888955       50031
12  4057192912       60391
13  3372868164       61275
14  4445114986       64396
15  4558609924       69423
16  7086361926       73247
17  2873212765       79639
18  1624580081       80299
19  6117666160       82486
20  1644430081       92748
21  4319703577       93847
22  5577150313       94690
23  8378563200       97623
24  5553957443      100257
25  3977333714      103967
26  4702921684      119151
27  2022484408      146099
28  2347167796      147001
29  7007744171      147124
30  8053475328      163288
31  6962181067      176956
32  4020332650      184851
33  8877689391      209005
34  1503960366      221170

In [ ]:
# 12. what is a totla acumulative calories burn for a person find out

In [57]:
df.groupby('Id')['Calories'].sum()

Id
1503960366    34128
1624580081    25705
1644430081    29164
1844505072    19391
1927972279    27048
2022484408    29704
2026352035    16266
2320127002    18385
2347167796    30320
2873212765    20349
2891001357    18187
3372868164    18603
3977333714    16777
4020332650    98412
4057192912    60913
4319703577    23931
4388161847    14442
4445114986    31617
4558609924    21962
4702921684    42322
5553957443    21630
5577150313    36303
6117666160    20993
6290855005    21656
6391747486    15868
6775888955    24523
6962181067    29249
7007744171    31525
7086361926    26124
8053475328    31825
8253242879    17556
8378563200    40274
8583815059    19130
8792009665    24884
8877689391    41414
Name: Calories, dtype: int64